hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/components/codec/wm8960/hpm_wm8960_regs.h
/*
 * Copyright (c) 2022 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */

#ifndef _HPM_WM8960_REG_H_
#define _HPM_WM8960_REG_H_

/* WM8960 register number */
#define WM8960_REG_NUM 56U

/* Define the register address of WM8960 */
#define WM8960_LINVOL   0x0U   /* Left Input Volume */
#define WM8960_RINVOL   0x1U   /* Right Input Volume */
#define WM8960_LOUT1    0x2U   /* LOUT1 Volume */
#define WM8960_ROUT1    0x3U   /* ROUT1 Volume */
#define WM8960_CLOCK1   0x4U   /* Clocking(1) */
#define WM8960_DACCTL1  0x5U   /* ADC and DAC Control (1) */
#define WM8960_DACCTL2  0x6U   /* ADC and DAC Control (2) */
#define WM8960_IFACE1   0x7U   /* Audio Interface */
#define WM8960_CLOCK2   0x8U   /* Clocking(2) */
#define WM8960_IFACE2   0x9U   /* Audio Interface */
#define WM8960_LDAC     0xaU   /* Left DAC */
#define WM8960_RDAC     0xbU   /* Right DAC Volume */
#define WM8960_RESET    0xfU   /* RESET */
#define WM8960_3D       0x10U  /* 3D Control */
#define WM8960_ALC1     0x11U  /* ALC (1) */
#define WM8960_ALC2     0x12U  /* ALC (2) */
#define WM8960_ALC3     0x13U  /* ALC (3) */
#define WM8960_NOISEG   0x14U  /* Noise Gate */
#define WM8960_LADC     0x15U  /* Left ADC  Volume */
#define WM8960_RADC     0x16U  /* Right ADC Volume */
#define WM8960_ADDCTL1  0x17U  /* Additional Control (1) */
#define WM8960_ADDCTL2  0x18U  /* Additional Control (2) */
#define WM8960_POWER1   0x19U  /* Power Mgmt (1) */
#define WM8960_POWER2   0x1aU  /* Power Mgmt (2) */
#define WM8960_ADDCTL3  0x1bU  /* Additional Control (3) */
#define WM8960_APOP1    0x1cU  /* Anti-Pop 1 */
#define WM8960_APOP2    0x1dU  /* Anti-pop 2 */
#define WM8960_LINPATH  0x20U  /* ADCL Signal Path */
#define WM8960_RINPATH  0x21U  /* ADCR  Signal  Path */
#define WM8960_LOUTMIX  0x22U  /* Left Out  Mix */
#define WM8960_ROUTMIX  0x25U  /* Right Out  Mix */
#define WM8960_MONOMIX1 0x26U  /* Mono Out Mix (1) */
#define WM8960_MONOMIX2 0x27U  /* Mono Out Mix (2) */
#define WM8960_LOUT2    0x28U  /* Left Speaker Volume */
#define WM8960_ROUT2    0x29U  /* Right Speaker Volume */
#define WM8960_MONO     0x2aU  /* OUT3 Volume */
#define WM8960_INBMIX1  0x2bU  /* Left Input Boost Mixer */
#define WM8960_INBMIX2  0x2cU  /* Right Input Boost Mixer */
#define WM8960_BYPASS1  0x2dU  /* Left Bypass */
#define WM8960_BYPASS2  0x2eU  /* Right Bypass */
#define WM8960_POWER3   0x2fU  /* Power Mgmt (3) */
#define WM8960_ADDCTL4  0x30U  /* Additional Control (4) */
#define WM8960_CLASSD1  0x31U  /* Class D Control (1) */
#define WM8960_CLASSD3  0x33U  /* Class D Control (2) */
#define WM8960_PLL1     0x34U  /* PLL (1) */
#define WM8960_PLL2     0x35U  /* PLL (2) */
#define WM8960_PLL3     0x36U  /* PLL (3) */
#define WM8960_PLL4     0x37U  /* PLL (4) */

/* Bitfield definition for register: LINVO */
/*
 * IPVU (RW)
 *
 * Input PGA Volume Update
 * Writing a 1 to this bit will cause left and right input PGA volumes to be updated (LINVOL and  RINVOL)
 */
#define WM8960_LINVO_IPVU_MASK (0x100U)
#define WM8960_LINVO_IPVU_SHIFT (8U)
#define WM8960_LINVO_IPVU_SET(x) (((uint16_t)(x) << WM8960_LINVO_IPVU_SHIFT) & WM8960_LINVO_IPVU_MASK)
#define WM8960_LINVO_IPVU_GET(x) (((uint16_t)(x) & WM8960_LINVO_IPVU_MASK) >> WM8960_LINVO_IPVU_SHIFT)

/*
 * LINMUTE (RW)
 *
 * Left Input PGA Analogue Mute 1 = Enable Mute 0 = Disable Mute Note: IPVU must be set to un-mute.
 */
#define WM8960_LINVO_LINMUTE_MASK (0x80U)
#define WM8960_LINVO_LINMUTE_SHIFT (7U)
#define WM8960_LINVO_LINMUTE_SET(x) (((uint16_t)(x) << WM8960_LINVO_LINMUTE_SHIFT) & WM8960_LINVO_LINMUTE_MASK)
#define WM8960_LINVO_LINMUTE_GET(x) (((uint16_t)(x) & WM8960_LINVO_LINMUTE_MASK) >> WM8960_LINVO_LINMUTE_SHIFT)

/*
 * LIZC (RW)
 *
 * Left Input PGA Zero Cross Detector 1 = Change gain on zero cross only 0 = Change gain immediately
 */
#define WM8960_LINVO_LIZC_MASK (0x40U)
#define WM8960_LINVO_LIZC_SHIFT (6U)
#define WM8960_LINVO_LIZC_SET(x) (((uint16_t)(x) << WM8960_LINVO_LIZC_SHIFT) & WM8960_LINVO_LIZC_MASK)
#define WM8960_LINVO_LIZC_GET(x) (((uint16_t)(x) & WM8960_LINVO_LIZC_MASK) >> WM8960_LINVO_LIZC_SHIFT)

/*
 * LINVOL (RW)
 *
 * Left Input PGA Volume Control
 * 111111 = +30dB
 * 111110 = +29.25dB
 * . . 0.75dB steps down to
 * 000000 = -17.25dB
 */
#define WM8960_LINVO_LINVOL_MASK (0x3FU)
#define WM8960_LINVO_LINVOL_SHIFT (0U)
#define WM8960_LINVO_LINVOL_SET(x) (((uint16_t)(x) << WM8960_LINVO_LINVOL_SHIFT) & WM8960_LINVO_LINVOL_MASK)
#define WM8960_LINVO_LINVOL_GET(x) (((uint16_t)(x) & WM8960_LINVO_LINVOL_MASK) >> WM8960_LINVO_LINVOL_SHIFT)

/* Bitfield definition for register: RINVOL */
/*
 * IPVU (RW)
 *
 * Input PGA Volume Update
 * Writing a 1 to this bit will cause left and right
 * input PGA volumes to be updated (LINVOL and RINVOL)
 */
#define WM8960_RINVOL_IPVU_MASK (0x100U)
#define WM8960_RINVOL_IPVU_SHIFT (8U)
#define WM8960_RINVOL_IPVU_SET(x) (((uint16_t)(x) << WM8960_RINVOL_IPVU_SHIFT) & WM8960_RINVOL_IPVU_MASK)
#define WM8960_RINVOL_IPVU_GET(x) (((uint16_t)(x) & WM8960_RINVOL_IPVU_MASK) >> WM8960_RINVOL_IPVU_SHIFT)

/*
 * RINMUTE (RW)
 *
 * Right Input PGA Analogue Mute
 * 1 = Enable Mute
 * 0 = Disable Mute
 * Note: IPVU must be set to un-mute.
 */
#define WM8960_RINVOL_RINMUTE_MASK (0x80U)
#define WM8960_RINVOL_RINMUTE_SHIFT (7U)
#define WM8960_RINVOL_RINMUTE_SET(x) (((uint16_t)(x) << WM8960_RINVOL_RINMUTE_SHIFT) & WM8960_RINVOL_RINMUTE_MASK)
#define WM8960_RINVOL_RINMUTE_GET(x) (((uint16_t)(x) & WM8960_RINVOL_RINMUTE_MASK) >> WM8960_RINVOL_RINMUTE_SHIFT)

/*
 * RIZC (RW)
 *
 * Right Input PGA Zero Cross Detector
 * 1 = Change gain on zero cross only
 * 0 = Change gain immediately
 */
#define WM8960_RINVOL_RIZC_MASK (0x40U)
#define WM8960_RINVOL_RIZC_SHIFT (6U)
#define WM8960_RINVOL_RIZC_SET(x) (((uint16_t)(x) << WM8960_RINVOL_RIZC_SHIFT) & WM8960_RINVOL_RIZC_MASK)
#define WM8960_RINVOL_RIZC_GET(x) (((uint16_t)(x) & WM8960_RINVOL_RIZC_MASK) >> WM8960_RINVOL_RIZC_SHIFT)

