hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/components/codec/wm8960/hpm_wm8960_regs.h
/*
 * WL (RW)
 *
 * Audio Data Word Length
 * 00 = 16 bits
 * 01 = 20 bits
 * 10 = 24 bits
 * 11 = 32 bits (see Note)
 */
#define WM8960_IFACE1_WL_MASK (0xCU)
#define WM8960_IFACE1_WL_SHIFT (2U)
#define WM8960_IFACE1_WL_SET(x) (((uint16_t)(x) << WM8960_IFACE1_WL_SHIFT) & WM8960_IFACE1_WL_MASK)
#define WM8960_IFACE1_WL_GET(x) (((uint16_t)(x) & WM8960_IFACE1_WL_MASK) >> WM8960_IFACE1_WL_SHIFT)

/*
 * FORMAT (RW)
 *
 * 00 = Right justified
 * 01 = Left justified
 * 10 = I2S Format
 * 11 = DSP Mode
 */
#define WM8960_IFACE1_FORMAT_MASK (0x3U)
#define WM8960_IFACE1_FORMAT_SHIFT (0U)
#define WM8960_IFACE1_FORMAT_SET(x) (((uint16_t)(x) << WM8960_IFACE1_FORMAT_SHIFT) & WM8960_IFACE1_FORMAT_MASK)
#define WM8960_IFACE1_FORMAT_GET(x) (((uint16_t)(x) & WM8960_IFACE1_FORMAT_MASK) >> WM8960_IFACE1_FORMAT_SHIFT)

/* Bitfield definition for register: CLOCK2 */
/*
 * DCLKDIV (RW)
 *
 * Class D switching clock divider.
 * 000 = SYSCLK / 1.5 (Not recommended)
 * 001 = SYSCLK / 2
 * 010 = SYSCLK / 3
 * 011 = SYSCLK / 4
 * 100 = SYSCLK / 6
 * 101 = SYSCLK / 8
 * 110 = SYSCLK / 12
 * 111 = SYSCLK / 16
 */
#define WM8960_CLOCK2_DCLKDIV_MASK (0x1C0U)
#define WM8960_CLOCK2_DCLKDIV_SHIFT (6U)
#define WM8960_CLOCK2_DCLKDIV_SET(x) (((uint16_t)(x) << WM8960_CLOCK2_DCLKDIV_SHIFT) & WM8960_CLOCK2_DCLKDIV_MASK)
#define WM8960_CLOCK2_DCLKDIV_GET(x) (((uint16_t)(x) & WM8960_CLOCK2_DCLKDIV_MASK) >> WM8960_CLOCK2_DCLKDIV_SHIFT)

/*
 * BCLKDIV (RW)
 *
 * BCLK Frequency (Master Mode)
 * 0000 = SYSCLK
 * 0001 = SYSCLK / 1.5
 * 0010 = SYSCLK / 2
 * 0011 = SYSCLK / 3
 * 0100 = SYSCLK / 4
 * 0101 = SYSCLK / 5.5
 * 0110 = SYSCLK / 6
 * 0111 = SYSCLK / 8
 * 1000 = SYSCLK / 11
 * 1001 = SYSCLK / 12
 * 1010 = SYSCLK / 16
 * 1011 = SYSCLK / 22
 * 1100 = SYSCLK / 24
 * 1101 to 1111 = SYSCLK / 32
 */
#define WM8960_CLOCK2_BCLKDIV_MASK (0xFU)
#define WM8960_CLOCK2_BCLKDIV_SHIFT (0U)
#define WM8960_CLOCK2_BCLKDIV_SET(x) (((uint16_t)(x) << WM8960_CLOCK2_BCLKDIV_SHIFT) & WM8960_CLOCK2_BCLKDIV_MASK)
#define WM8960_CLOCK2_BCLKDIV_GET(x) (((uint16_t)(x) & WM8960_CLOCK2_BCLKDIV_MASK) >> WM8960_CLOCK2_BCLKDIV_SHIFT)

/* Bitfield definition for register: IFACE2 */
/*
 * ALRCGPIO (RW)
 *
 * ADCLRC/GPIO1 Pin Function Select
 * 0 = ADCLRC frame clock for ADC
 * 1 = GPIO pin
 */
#define WM8960_IFACE2_ALRCGPIO_MASK (0x40U)
#define WM8960_IFACE2_ALRCGPIO_SHIFT (6U)
#define WM8960_IFACE2_ALRCGPIO_SET(x) (((uint16_t)(x) << WM8960_IFACE2_ALRCGPIO_SHIFT) & WM8960_IFACE2_ALRCGPIO_MASK)
#define WM8960_IFACE2_ALRCGPIO_GET(x) (((uint16_t)(x) & WM8960_IFACE2_ALRCGPIO_MASK) >> WM8960_IFACE2_ALRCGPIO_SHIFT)

/*
 * WL8 (RW)
 *
 * 8-Bit Word Length Select (Used with
 * companding)
 * 0 = Off
 * 1 = Device operates in 8-bit mode.
 */
#define WM8960_IFACE2_WL8_MASK (0x20U)
#define WM8960_IFACE2_WL8_SHIFT (5U)
#define WM8960_IFACE2_WL8_SET(x) (((uint16_t)(x) << WM8960_IFACE2_WL8_SHIFT) & WM8960_IFACE2_WL8_MASK)
#define WM8960_IFACE2_WL8_GET(x) (((uint16_t)(x) & WM8960_IFACE2_WL8_MASK) >> WM8960_IFACE2_WL8_SHIFT)

/*
 * DACCOMP (RW)
 *
 * DAC companding
 * 00 = off
 * 01 = reserved
 * 10 = μ-law
 * 11 = A-law
 */
#define WM8960_IFACE2_DACCOMP_MASK (0x18U)
#define WM8960_IFACE2_DACCOMP_SHIFT (3U)
#define WM8960_IFACE2_DACCOMP_SET(x) (((uint16_t)(x) << WM8960_IFACE2_DACCOMP_SHIFT) & WM8960_IFACE2_DACCOMP_MASK)
#define WM8960_IFACE2_DACCOMP_GET(x) (((uint16_t)(x) & WM8960_IFACE2_DACCOMP_MASK) >> WM8960_IFACE2_DACCOMP_SHIFT)

/*
 * ADCCOMP (RW)
 *
 * ADC companding
 * 00 = off
 * 01 = reserved
 * 10 = μ-law
 * 11 = A-law
 */
#define WM8960_IFACE2_ADCCOMP_MASK (0x6U)
#define WM8960_IFACE2_ADCCOMP_SHIFT (1U)
#define WM8960_IFACE2_ADCCOMP_SET(x) (((uint16_t)(x) << WM8960_IFACE2_ADCCOMP_SHIFT) & WM8960_IFACE2_ADCCOMP_MASK)
#define WM8960_IFACE2_ADCCOMP_GET(x) (((uint16_t)(x) & WM8960_IFACE2_ADCCOMP_MASK) >> WM8960_IFACE2_ADCCOMP_SHIFT)

/*
 * LOOPBACK (RW)
 *
 * Digital Loopback Function
 * 0 = No loopback.
 * 1 = Loopback enabled, ADC data output is fed
 * directly into DAC data input
 */
#define WM8960_IFACE2_LOOPBACK_MASK (0x1U)
#define WM8960_IFACE2_LOOPBACK_SHIFT (0U)
#define WM8960_IFACE2_LOOPBACK_SET(x) (((uint16_t)(x) << WM8960_IFACE2_LOOPBACK_SHIFT) & WM8960_IFACE2_LOOPBACK_MASK)
#define WM8960_IFACE2_LOOPBACK_GET(x) (((uint16_t)(x) & WM8960_IFACE2_LOOPBACK_MASK) >> WM8960_IFACE2_LOOPBACK_SHIFT)

/* Bitfield definition for register: LDAC */
/*
 * DACVU (RW)
 *
 * DAC Volume Update
 * Writing a 1 to this bit will cause left and right
 * DAC volumes to be updated (LDACVOL and RDACVOL)
 */
#define WM8960_LDAC_DACVU_MASK (0x100U)
#define WM8960_LDAC_DACVU_SHIFT (8U)
#define WM8960_LDAC_DACVU_SET(x) (((uint16_t)(x) << WM8960_LDAC_DACVU_SHIFT) & WM8960_LDAC_DACVU_MASK)
#define WM8960_LDAC_DACVU_GET(x) (((uint16_t)(x) & WM8960_LDAC_DACVU_MASK) >> WM8960_LDAC_DACVU_SHIFT)

/*
 * LDACVOL (RW)
 *
 * Left DAC Digital Volume Control
 * 0000 0000 = Digital Mute
 * 0000 0001 = -127dB
 * 0000 0010 = -126.5dB
 * ... 0.5dB steps up to
 * 1111 1111 = 0dB
 */
#define WM8960_LDAC_LDACVOL_MASK (0xFFU)
#define WM8960_LDAC_LDACVOL_SHIFT (0U)
#define WM8960_LDAC_LDACVOL_SET(x) (((uint16_t)(x) << WM8960_LDAC_LDACVOL_SHIFT) & WM8960_LDAC_LDACVOL_MASK)
#define WM8960_LDAC_LDACVOL_GET(x) (((uint16_t)(x) & WM8960_LDAC_LDACVOL_MASK) >> WM8960_LDAC_LDACVOL_SHIFT)

/* Bitfield definition for register: RDAC */
/*
 * DACVU (RW)
 *
 * DAC Volume Update
 * Writing a 1 to this bit will cause left and right
 * DAC volumes to be updated (LDACVOL and RDACVOL)
 */
#define WM8960_RDAC_DACVU_MASK (0x100U)
#define WM8960_RDAC_DACVU_SHIFT (8U)
#define WM8960_RDAC_DACVU_SET(x) (((uint16_t)(x) << WM8960_RDAC_DACVU_SHIFT) & WM8960_RDAC_DACVU_MASK)
#define WM8960_RDAC_DACVU_GET(x) (((uint16_t)(x) & WM8960_RDAC_DACVU_MASK) >> WM8960_RDAC_DACVU_SHIFT)

/*
 * RDACVOL (RW)
 *
 * Right DAC Digital Volume Control
 * 0000 0000 = Digital Mute
 * 0000 0001 = -127dB
 * 0000 0010 = -126.5dB
 * ... 0.5dB steps up to
 * 1111 1111 = 0dB
 */
#define WM8960_RDAC_RDACVOL_MASK (0xFFU)
#define WM8960_RDAC_RDACVOL_SHIFT (0U)
#define WM8960_RDAC_RDACVOL_SET(x) (((uint16_t)(x) << WM8960_RDAC_RDACVOL_SHIFT) & WM8960_RDAC_RDACVOL_MASK)
#define WM8960_RDAC_RDACVOL_GET(x) (((uint16_t)(x) & WM8960_RDAC_RDACVOL_MASK) >> WM8960_RDAC_RDACVOL_SHIFT)

/* Bitfield definition for register: RESET */
/*
 * RESET (RW)
 *
 * Writing to this register resets all registers to their default state.
 */
#define WM8960_RESET_RESET_MASK (0x1FFU)
#define WM8960_RESET_RESET_SHIFT (0U)
#define WM8960_RESET_RESET_SET(x) (((uint16_t)(x) << WM8960_RESET_RESET_SHIFT) & WM8960_RESET_RESET_MASK)
#define WM8960_RESET_RESET_GET(x) (((uint16_t)(x) & WM8960_RESET_RESET_MASK) >> WM8960_RESET_RESET_SHIFT)

/* Bitfield definition for register: 3D */
/*
 * 3DUC (RW)
 *
 * 3D Enhance Filter Upper Cut-Off Frequency
 * 0 = High (Recommended for fs>=32kHz)
 * 1 = Low (Recommended for fs<32kHz)
 */
#define WM8960_3D_3DUC_MASK (0x40U)
#define WM8960_3D_3DUC_SHIFT (6U)
#define WM8960_3D_3DUC_SET(x) (((uint16_t)(x) << WM8960_3D_3DUC_SHIFT) & WM8960_3D_3DUC_MASK)
#define WM8960_3D_3DUC_GET(x) (((uint16_t)(x) & WM8960_3D_3DUC_MASK) >> WM8960_3D_3DUC_SHIFT)

