hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/components/codec/wm8960/hpm_wm8960_regs.h
/* Bitfield definition for register: LADC */
/*
 * ADCVU (RW)
 *
 * ADC Volume Update
 * Writing a 1 to this bit will cause left and right
 * ADC volumes to be updated (LADCVOL and
 * RADCVOL)
 */
#define WM8960_LADC_ADCVU_MASK (0x100U)
#define WM8960_LADC_ADCVU_SHIFT (8U)
#define WM8960_LADC_ADCVU_SET(x) (((uint16_t)(x) << WM8960_LADC_ADCVU_SHIFT) & WM8960_LADC_ADCVU_MASK)
#define WM8960_LADC_ADCVU_GET(x) (((uint16_t)(x) & WM8960_LADC_ADCVU_MASK) >> WM8960_LADC_ADCVU_SHIFT)

/*
 * LADCVOL (RW)
 *
 * Left ADC Digital Volume Control
 * 0000 0000 = Digital Mute
 * 0000 0001 = -97dB
 * 0000 0010 = -96.5dB
 * ... 0.5dB steps up to
 * 1111 1111 = +30dB
 */
#define WM8960_LADC_LADCVOL_MASK (0xFFU)
#define WM8960_LADC_LADCVOL_SHIFT (0U)
#define WM8960_LADC_LADCVOL_SET(x) (((uint16_t)(x) << WM8960_LADC_LADCVOL_SHIFT) & WM8960_LADC_LADCVOL_MASK)
#define WM8960_LADC_LADCVOL_GET(x) (((uint16_t)(x) & WM8960_LADC_LADCVOL_MASK) >> WM8960_LADC_LADCVOL_SHIFT)

/* Bitfield definition for register: RADC */
/*
 * ADCVU (RW)
 *
 * ADC Volume Update
 * Writing a 1 to this bit will cause left and right
 * ADC volumes to be updated (LADCVOL and RADCVOL)
 */
#define WM8960_RADC_ADCVU_MASK (0x100U)
#define WM8960_RADC_ADCVU_SHIFT (8U)
#define WM8960_RADC_ADCVU_SET(x) (((uint16_t)(x) << WM8960_RADC_ADCVU_SHIFT) & WM8960_RADC_ADCVU_MASK)
#define WM8960_RADC_ADCVU_GET(x) (((uint16_t)(x) & WM8960_RADC_ADCVU_MASK) >> WM8960_RADC_ADCVU_SHIFT)

/*
 * RADCVOL (RW)
 *
 * Right ADC Digital Volume Control
 * 0000 0000 = Digital Mute
 * 0000 0001 = -97dB
 * 0000 0010 = -96.5dB
 * ... 0.5dB steps up to
 * 1111 1111 = +30dB
 */
#define WM8960_RADC_RADCVOL_MASK (0xFFU)
#define WM8960_RADC_RADCVOL_SHIFT (0U)
#define WM8960_RADC_RADCVOL_SET(x) (((uint16_t)(x) << WM8960_RADC_RADCVOL_SHIFT) & WM8960_RADC_RADCVOL_MASK)
#define WM8960_RADC_RADCVOL_GET(x) (((uint16_t)(x) & WM8960_RADC_RADCVOL_MASK) >> WM8960_RADC_RADCVOL_SHIFT)

/* Bitfield definition for register: ADDCTL1 */
/*
 * TSDEN (RW)
 *
 * Thermal Shutdown Enable
 * 0 = Thermal shutdown disabled
 * 1 = Thermal shutdown enabled
 * (TSENSEN must be enabled for this function to work)
 */
#define WM8960_ADDCTL1_TSDEN_MASK (0x100U)
#define WM8960_ADDCTL1_TSDEN_SHIFT (8U)
#define WM8960_ADDCTL1_TSDEN_SET(x) (((uint16_t)(x) << WM8960_ADDCTL1_TSDEN_SHIFT) & WM8960_ADDCTL1_TSDEN_MASK)
#define WM8960_ADDCTL1_TSDEN_GET(x) (((uint16_t)(x) & WM8960_ADDCTL1_TSDEN_MASK) >> WM8960_ADDCTL1_TSDEN_SHIFT)

/*
 * VSEL (RW)
 *
 * Analogue Bias Optimisation
 * 00 = Reserved
 * 01 = Increased bias current optimized for
 * AVDD=2.7V
 * 1X = Lowest bias current, optimized for
 * AVDD=3.3V
 */
#define WM8960_ADDCTL1_VSEL_MASK (0xC0U)
#define WM8960_ADDCTL1_VSEL_SHIFT (6U)
#define WM8960_ADDCTL1_VSEL_SET(x) (((uint16_t)(x) << WM8960_ADDCTL1_VSEL_SHIFT) & WM8960_ADDCTL1_VSEL_MASK)
#define WM8960_ADDCTL1_VSEL_GET(x) (((uint16_t)(x) & WM8960_ADDCTL1_VSEL_MASK) >> WM8960_ADDCTL1_VSEL_SHIFT)

/*
 * DMONOMIX (RW)
 *
 * DAC Mono Mix
 * 0 = Stereo
 * 1 = Mono (Mono MIX output on enabled DACs
 */
#define WM8960_ADDCTL1_DMONOMIX_MASK (0x10U)
#define WM8960_ADDCTL1_DMONOMIX_SHIFT (4U)
#define WM8960_ADDCTL1_DMONOMIX_SET(x) (((uint16_t)(x) << WM8960_ADDCTL1_DMONOMIX_SHIFT) & WM8960_ADDCTL1_DMONOMIX_MASK)
#define WM8960_ADDCTL1_DMONOMIX_GET(x) (((uint16_t)(x) & WM8960_ADDCTL1_DMONOMIX_MASK) >> WM8960_ADDCTL1_DMONOMIX_SHIFT)

/*
 * DATSEL (RW)
 *
 * ADC Data Output Select
 * 00: left data = left ADC; right data =right ADC
 * 01: left data = left ADC; right data = left ADC
 * 10: left data = right ADC; right data =right ADC
 * 11: left data = right ADC; right data = left ADC
 */
#define WM8960_ADDCTL1_DATSEL_MASK (0xCU)
#define WM8960_ADDCTL1_DATSEL_SHIFT (2U)
#define WM8960_ADDCTL1_DATSEL_SET(x) (((uint16_t)(x) << WM8960_ADDCTL1_DATSEL_SHIFT) & WM8960_ADDCTL1_DATSEL_MASK)
#define WM8960_ADDCTL1_DATSEL_GET(x) (((uint16_t)(x) & WM8960_ADDCTL1_DATSEL_MASK) >> WM8960_ADDCTL1_DATSEL_SHIFT)

/*
 * TOCLKSEL (RW)
 *
 * Slow Clock Select (Used for volume update
 * timeouts and for jack detect debounce)
 * 0 = SYSCLK / 221 (Slower Response)
 * 1 = SYSCLK / 219 (Faster Response)
 */
#define WM8960_ADDCTL1_TOCLKSEL_MASK (0x2U)
#define WM8960_ADDCTL1_TOCLKSEL_SHIFT (1U)
#define WM8960_ADDCTL1_TOCLKSEL_SET(x) (((uint16_t)(x) << WM8960_ADDCTL1_TOCLKSEL_SHIFT) & WM8960_ADDCTL1_TOCLKSEL_MASK)
#define WM8960_ADDCTL1_TOCLKSEL_GET(x) (((uint16_t)(x) & WM8960_ADDCTL1_TOCLKSEL_MASK) >> WM8960_ADDCTL1_TOCLKSEL_SHIFT)

/*
 * TOEN (RW)
 *
 * Enables Slow Clock for Volume Update Timeout
 * and Jack Detect Debounce
 * 0 = Slow clock disabled
 * 1 = Slow clock enabled
 */
#define WM8960_ADDCTL1_TOEN_MASK (0x1U)
#define WM8960_ADDCTL1_TOEN_SHIFT (0U)
#define WM8960_ADDCTL1_TOEN_SET(x) (((uint16_t)(x) << WM8960_ADDCTL1_TOEN_SHIFT) & WM8960_ADDCTL1_TOEN_MASK)
#define WM8960_ADDCTL1_TOEN_GET(x) (((uint16_t)(x) & WM8960_ADDCTL1_TOEN_MASK) >> WM8960_ADDCTL1_TOEN_SHIFT)

/* Bitfield definition for register: ADDCTL2 */
/*
 * HPSWEN (RW)
 *
 * Headphone Switch Enable
 * 0 = Headphone switch disabled
 * 1 = Headphone switch enabled
 */
#define WM8960_ADDCTL2_HPSWEN_MASK (0x40U)
#define WM8960_ADDCTL2_HPSWEN_SHIFT (6U)
#define WM8960_ADDCTL2_HPSWEN_SET(x) (((uint16_t)(x) << WM8960_ADDCTL2_HPSWEN_SHIFT) & WM8960_ADDCTL2_HPSWEN_MASK)
#define WM8960_ADDCTL2_HPSWEN_GET(x) (((uint16_t)(x) & WM8960_ADDCTL2_HPSWEN_MASK) >> WM8960_ADDCTL2_HPSWEN_SHIFT)

/*
 * HPSWPOL (RW)
 *
 * Headphone Switch Polarity
 * 0 = HPDETECT high = headphone
 * 1 = HPDETECT high = speaker
 */
#define WM8960_ADDCTL2_HPSWPOL_MASK (0x20U)
#define WM8960_ADDCTL2_HPSWPOL_SHIFT (5U)
#define WM8960_ADDCTL2_HPSWPOL_SET(x) (((uint16_t)(x) << WM8960_ADDCTL2_HPSWPOL_SHIFT) & WM8960_ADDCTL2_HPSWPOL_MASK)
#define WM8960_ADDCTL2_HPSWPOL_GET(x) (((uint16_t)(x) & WM8960_ADDCTL2_HPSWPOL_MASK) >> WM8960_ADDCTL2_HPSWPOL_SHIFT)

/*
 * TRIS (RW)
 *
 * Tristates ADCDAT and switches ADCLRC,
 * DACLRC and BCLK to inputs.
 * 0 = ADCDAT is an output; ADCLRC, DACLRC
 * and BCLK are inputs (slave mode) or outputs
 * (master mode)
 * 1 = ADCDAT is tristated; DACLRC and BCLK
 * are inputs; ADCLRC is an input (when not
 * configured as a GPIO)
 */
#define WM8960_ADDCTL2_TRIS_MASK (0x8U)
#define WM8960_ADDCTL2_TRIS_SHIFT (3U)
#define WM8960_ADDCTL2_TRIS_SET(x) (((uint16_t)(x) << WM8960_ADDCTL2_TRIS_SHIFT) & WM8960_ADDCTL2_TRIS_MASK)
#define WM8960_ADDCTL2_TRIS_GET(x) (((uint16_t)(x) & WM8960_ADDCTL2_TRIS_MASK) >> WM8960_ADDCTL2_TRIS_SHIFT)

