hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/components/codec/wm8960/hpm_wm8960_regs.h
/*
 * MBSEL (RW)
 *
 * Microphone Bias Voltage Control
 * 0 = 0.9 * AVDD
 * 1 = 0.65 * AVDD
 */
#define WM8960_ADDCTL4_MBSEL_MASK (0x1U)
#define WM8960_ADDCTL4_MBSEL_SHIFT (0U)
#define WM8960_ADDCTL4_MBSEL_SET(x) (((uint16_t)(x) << WM8960_ADDCTL4_MBSEL_SHIFT) & WM8960_ADDCTL4_MBSEL_MASK)
#define WM8960_ADDCTL4_MBSEL_GET(x) (((uint16_t)(x) & WM8960_ADDCTL4_MBSEL_MASK) >> WM8960_ADDCTL4_MBSEL_SHIFT)

/* Bitfield definition for register: CLASSD1 */
/*
 * SPK_OP_EN (RW)
 *
 * Enable Class D Speaker Outputs
 * 00 = Off
 * 01 = Left speaker only
 * 10 = Right speaker only
 * 11 = Left and right speakers enabled
 */
#define WM8960_CLASSD1_SPK_OP_EN_MASK (0xC0U)
#define WM8960_CLASSD1_SPK_OP_EN_SHIFT (6U)
#define WM8960_CLASSD1_SPK_OP_EN_SET(x) (((uint16_t)(x) << WM8960_CLASSD1_SPK_OP_EN_SHIFT) & WM8960_CLASSD1_SPK_OP_EN_MASK)
#define WM8960_CLASSD1_SPK_OP_EN_GET(x) (((uint16_t)(x) & WM8960_CLASSD1_SPK_OP_EN_MASK) >> WM8960_CLASSD1_SPK_OP_EN_SHIFT)

/* Bitfield definition for register: CLASSD3 */
/*
 * DCGAIN (RW)
 *
 * DC Speaker Boost (Boosts speaker DC output
 * level by up to 1.8 x on left and right channels)
 * 000 = 1.00x boost (+0dB)
 * 001 = 1.27x boost (+2.1dB)
 * 010 = 1.40x boost (+2.9dB)
 * 011 = 1.52x boost (+3.6dB)
 * 100 = 1.67x boost (+4.5dB)
 * 101 = 1.8x boost (+5.1dB)
 * 110 to 111 = Reserved
 */
#define WM8960_CLASSD3_DCGAIN_MASK (0x38U)
#define WM8960_CLASSD3_DCGAIN_SHIFT (3U)
#define WM8960_CLASSD3_DCGAIN_SET(x) (((uint16_t)(x) << WM8960_CLASSD3_DCGAIN_SHIFT) & WM8960_CLASSD3_DCGAIN_MASK)
#define WM8960_CLASSD3_DCGAIN_GET(x) (((uint16_t)(x) & WM8960_CLASSD3_DCGAIN_MASK) >> WM8960_CLASSD3_DCGAIN_SHIFT)

/*
 * ACGAIN (RW)
 *
 * AC Speaker Boost (Boosts speaker AC output
 * signal by up to 1.8 x on left and right channels)
 * 000 = 1.00x boost (+0dB)
 * 001 = 1.27x boost (+2.1dB)
 * 010 = 1.40x boost (+2.9dB)
 * 011 = 1.52x boost (+3.6dB)
 * 100 = 1.67x boost (+4.5dB)
 * 101 = 1.8x boost (+5.1dB)
 * 110 to 111 = Reserved
 */
#define WM8960_CLASSD3_ACGAIN_MASK (0x7U)
#define WM8960_CLASSD3_ACGAIN_SHIFT (0U)
#define WM8960_CLASSD3_ACGAIN_SET(x) (((uint16_t)(x) << WM8960_CLASSD3_ACGAIN_SHIFT) & WM8960_CLASSD3_ACGAIN_MASK)
#define WM8960_CLASSD3_ACGAIN_GET(x) (((uint16_t)(x) & WM8960_CLASSD3_ACGAIN_MASK) >> WM8960_CLASSD3_ACGAIN_SHIFT)

/* Bitfield definition for register: PLL1 */
/*
 * OPCLKDIV (RW)
 *
 * SYSCLK Output to GPIO Clock Division ratio
 * 000 = SYSCLK
 * 001 = SYSCLK / 2
 * 010 = SYSCLK / 3
 * 011 = SYSCLK / 4
 * 100 = SYSCLK / 5.5
 * 101 = SYSCLK / 6
 */
#define WM8960_PLL1_OPCLKDIV_MASK (0x1C0U)
#define WM8960_PLL1_OPCLKDIV_SHIFT (6U)
#define WM8960_PLL1_OPCLKDIV_SET(x) (((uint16_t)(x) << WM8960_PLL1_OPCLKDIV_SHIFT) & WM8960_PLL1_OPCLKDIV_MASK)
#define WM8960_PLL1_OPCLKDIV_GET(x) (((uint16_t)(x) & WM8960_PLL1_OPCLKDIV_MASK) >> WM8960_PLL1_OPCLKDIV_SHIFT)

/*
 * SDM (RW)
 *
 * Enable Integer Mode
 * 0 = Integer mode
 * 1 = Fractional mode
 */
#define WM8960_PLL1_SDM_MASK (0x20U)
#define WM8960_PLL1_SDM_SHIFT (5U)
#define WM8960_PLL1_SDM_SET(x) (((uint16_t)(x) << WM8960_PLL1_SDM_SHIFT) & WM8960_PLL1_SDM_MASK)
#define WM8960_PLL1_SDM_GET(x) (((uint16_t)(x) & WM8960_PLL1_SDM_MASK) >> WM8960_PLL1_SDM_SHIFT)

/*
 * PLLPRESCALE (RW)
 *
 * Divide MCLK by 2 before input to PLL
 * 0 = Divide by 1
 * 1 = Divide by 2
 */
#define WM8960_PLL1_PLLPRESCALE_MASK (0x10U)
#define WM8960_PLL1_PLLPRESCALE_SHIFT (4U)
#define WM8960_PLL1_PLLPRESCALE_SET(x) (((uint16_t)(x) << WM8960_PLL1_PLLPRESCALE_SHIFT) & WM8960_PLL1_PLLPRESCALE_MASK)
#define WM8960_PLL1_PLLPRESCALE_GET(x) (((uint16_t)(x) & WM8960_PLL1_PLLPRESCALE_MASK) >> WM8960_PLL1_PLLPRESCALE_SHIFT)

/*
 * PLLN (RW)
 *
 * Integer (N) part of PLL input/output frequency
 * ratio. Use values greater than 5 and less than 13
 */
#define WM8960_PLL1_PLLN_MASK (0xFU)
#define WM8960_PLL1_PLLN_SHIFT (0U)
#define WM8960_PLL1_PLLN_SET(x) (((uint16_t)(x) << WM8960_PLL1_PLLN_SHIFT) & WM8960_PLL1_PLLN_MASK)
#define WM8960_PLL1_PLLN_GET(x) (((uint16_t)(x) & WM8960_PLL1_PLLN_MASK) >> WM8960_PLL1_PLLN_SHIFT)

/* Bitfield definition for register: PLL2 */
/*
 * PLLK (RW)
 *
 * Fractional (K) part of PLL1 input/output
 * frequency ratio (treat as one 24-digit binary number).
 */
#define WM8960_PLL2_PLLK_MASK (0xFFU)
#define WM8960_PLL2_PLLK_SHIFT (0U)
#define WM8960_PLL2_PLLK_SET(x) (((uint16_t)(x) << WM8960_PLL2_PLLK_SHIFT) & WM8960_PLL2_PLLK_MASK)
#define WM8960_PLL2_PLLK_GET(x) (((uint16_t)(x) & WM8960_PLL2_PLLK_MASK) >> WM8960_PLL2_PLLK_SHIFT)

/* Bitfield definition for register: PLL3 */
/*
 * PLLK (RW)
 *
 * Fractional (K) part of PLL1 input/output
 * frequency ratio (treat as one 24-digit binary number).
 */
#define WM8960_PLL3_PLLK_MASK (0xFFU)
#define WM8960_PLL3_PLLK_SHIFT (0U)
#define WM8960_PLL3_PLLK_SET(x) (((uint16_t)(x) << WM8960_PLL3_PLLK_SHIFT) & WM8960_PLL3_PLLK_MASK)
#define WM8960_PLL3_PLLK_GET(x) (((uint16_t)(x) & WM8960_PLL3_PLLK_MASK) >> WM8960_PLL3_PLLK_SHIFT)

/* Bitfield definition for register: PLL4 */
/*
 * PLLK (RW)
 *
 * Fractional (K) part of PLL1 input/output
 * frequency ratio (treat as one 24-digit binary number).
 */
#define WM8960_PLL4_PLLK_MASK (0xFFU)
#define WM8960_PLL4_PLLK_SHIFT (0U)
#define WM8960_PLL4_PLLK_SET(x) (((uint16_t)(x) << WM8960_PLL4_PLLK_SHIFT) & WM8960_PLL4_PLLK_MASK)
#define WM8960_PLL4_PLLK_GET(x) (((uint16_t)(x) & WM8960_PLL4_PLLK_MASK) >> WM8960_PLL4_PLLK_SHIFT)


#endif /* _HPM_WM8960_REG_H_ */
